tests/load_test.yml
# tests/load_test.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    - duration: 30
      arrivalRate: 50
      name: "Sustained load"

scenarios:
  - name: "Basic flow"
    flow:
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/login/"
      - think: 2
      - post:
          url: "/login/"
          json:
            username: "test"
            password: "Test1@test"